---
type: TransferringProjectStandardsEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 4
tags: [revit-api, class]
---

# TransferringProjectStandardsEventArgs

`Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetExternalItems | 2017.2 | `public IDictionary < Guid , string > GetExternalItems ()` |
| Method | SetExternalItems | 2017.2 | `public void SetExternalItems ( IDictionary < Guid , string > externalItems )` |
| Property | SourceDocument | 2017.2 | `public Document SourceDocument { get ; }` |
| Property | TargetDocument | 2017.2 | `public Document TargetDocument { get ; }` |